src/DataProcessors/ИС_МП_СопоставлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИС_МП_СопоставлениеТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ИС_Ozon_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ozon_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураOzon</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Сбер_Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Сбер_Товары</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>offerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_АЛИ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_АЛИ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВариацияАЛИ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_МВМ_СоответствиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МВМ_СоответствиеТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварМВМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_Ламода_СоответствиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_Ламода_СоответствиеТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерЛамода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИС_МП_СопоставлениеТоваров/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	ИС_МП_Сервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Маркетплейс = "ВБ";
	ПроцентСопоставления = "0 / 0 (0.00%)";
	ПодбиратьПо = "Штрихкод";
	РеквизитПодбора = "Код";
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОпределитьИнтегрируемыеМаркетплейсы();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура ГруппаТаблицаСопоставленияПриСменеСтраницы(Элемент, ТекущаяСтраница)	
		
	Маркетплейс = СтрЗаменить(ТекущаяСтраница.Имя, "Страница", "");
	
	Если Модифицированность Тогда
	
		Оповещение = Новый ОписаниеОповещения("ПриСменеСтраницыЗавершение", ЭтотОбъект, Параметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	
	Иначе
		ЗаполнитьТаблицуСопоставления();
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006  

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
&НаКлиенте
Процедура РеквизитСопоставленияПриИзменении(Элемент)
	
	ТекДанные = Элементы["Товары" + Маркетплейс].ТекущиеДанные;
    
    Если ТекДанные = Неопределено Тогда
    	Возврат;
    КонецЕсли;
	
	Если ТекДанные.Номенклатура <> ТекДанные.ТекущаяНоменклатура 
			Или ТекДанные.Характеристика <> ТекДанные.ТекущаяХарактеристика
			Или ТекДанные.Упаковка <> ТекДанные.ТекущаяУпаковка Тогда
	
	    ТекДанные.Модифицированность = Истина;
	    Модифицированность = Истина;
		
	КонецЕсли;
    
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #68819
&НаКлиенте
Процедура ПрофильПриИзменении(Элемент)
	
	Если Модифицированность Тогда
	   
	    Оповещение = Новый ОписаниеОповещения("ПрофильПриИзмененииЗавершение", ЭтотОбъект, Параметры);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
		Возврат;
					
	КонецЕсли;
		
	ОпределитьИнтегрируемыеМаркетплейсы();
	ГруппаТаблицаСопоставленияПриСменеСтраницы(Элементы.ГруппаСтраницы, Элементы.ГруппаСтраницы.ТекущаяСтраница);
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		ЗаполнитьТаблицуСопоставления();
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #68819
&НаКлиенте
Процедура ПодбиратьПоПриИзменении(Элемент)
	
	Если ПодбиратьПо = "Реквизит" Тогда
	
		Если Маркетплейс = "Сбер" Или Маркетплейс = "Али" Тогда
			Элементы.ГруппПодборРеквизит.Видимость = Истина;
		Иначе
			ПодбиратьПо = "ПроизвольныйЗапрос";
		    ОбщегоНазначенияКлиент.СообщитьПользователю("Подбор по ""Реквизиту"" доступен только для Маркетплейсов ""Мега Маркет"" и ""Aliexpress""");
		КонецЕсли;
			
	Иначе
		Элементы.ГруппПодборРеквизит.Видимость = Ложь;
	КонецЕсли;
	
	Если ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		Элементы.УстановитьТекстЗапроса.Видимость = Истина;
	Иначе
		Элементы.УстановитьТекстЗапроса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 22.01.24 УА #68819
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если Модифицированность Тогда

		Отказ = Истина;

		Если ЗавершениеРаботы Тогда
			ТекстПредупреждения = НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'");
			Возврат;
		КонецЕсли;		
		
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение, 
			НСтр("ru = 'Имеются несохраненные данные, все изменения будут утеряны. Хотите продолжить?'"), 
			РежимДиалогаВопрос.ДаНет);
	
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 22.01.24 УА #68819

#КонецОбласти

#Область ОбработчикиКомандФормы   

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура Обновить(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , "Профиль");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуСопоставления();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура Подбор(Команда)	
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран профиль", , "Профиль");
		Возврат;
	КонецЕсли;
	
	МассивСопоставления = Новый Массив;
	
	ПолеСопоставления = ИС_МП_Клиент.ПолеСопоставленияОстатков(Маркетплейс);
	
	Для Каждого Строка Из ЭтотОбъект["Товары" + Маркетплейс] Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			МассивСопоставления.Добавить(Строка[ПолеСопоставления]);
		КонецЕсли;	
		
	КонецЦикла;
	
	ПодборНаСервере(МассивСопоставления, ПолеСопоставления);
		
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура Записать(Команда)
	
	Если Не Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	ЗаписатьИзмененияНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если Модифицированность Тогда
		ЗаписатьИзмененияНаСервере();
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура УдалитьСопоставление(Команда)
	
	ВыделенныеСтроки = Элементы["Товары" + Маркетплейс].ВыделенныеСтроки;
	
	Если ВыделенныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьСопоставлениеНаСервере();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура УстановитьТекстЗапроса(Команда)
	
	ДопПараметры = Новый Структура("Профиль", Профиль);
	ДопПараметры.Вставить("Маркетплейс", Маркетплейс);
	
	ОткрытьФорму("Обработка.ИС_МП_СопоставлениеТоваров.Форма.ФормаУстановкиЗапроса", ДопПараметры, ЭтотОбъект);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	ТипЭлементОтбораКомпоновкиДанных = Тип("ЭлементОтбораКомпоновкиДанных");
	ОформлениеЦветТекста = "ЦветТекста";
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
		
	Для Каждого МП Из ИнтегрируемыеМаркетплейсы Цикл 
		
		ТоварыМП = "Товары" + МП; 
		
		// Номенклатура не заполнена
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ТоварыМП);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТоварыМП + ".Номенклатура");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветОсобогоТекста);
		
		// Номенклатура заполнена
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ТоварыМП);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТоварыМП + ".Номенклатура");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, ЦветаСтиля.ЦветАкцента);
		
		// Модифицированность
		
		Элемент = УсловноеОформление.Элементы.Добавить();
		ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ТоварыМП);
		
		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(ТипЭлементОтбораКомпоновкиДанных);
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ТоварыМП + ".Модифицированность");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = Истина;
		
		Элемент.Оформление.УстановитьЗначениеПараметра(ОформлениеЦветТекста, WebЦвета.ТемноОранжевый);
		
	КонецЦикла;
					
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #86001
&НаСервере   
Процедура ОпределитьИнтегрируемыеМаркетплейсы()
	
	ИнтегрируемыеМаркетплейсы = ИС_МП_Сервер.ИнтегрируемыеМаркетплейсы();
		
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из ИнтегрируемыеМаркетплейсы Цикл
		СтруктураНастроек.Вставить(Элемент, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Интеграция" + Элемент));	
	КонецЦикла;
	
	ТребуетсяСменаСтраницы = Ложь;
	ПерваяДоступнаяСтраница = Неопределено;
	ОТУпаковки = Новый ОписаниеТипов(ИС_МП_СерверЛокализация.СтрокаТипУпаковка());
	
	Для Каждого Элемент Из СтруктураНастроек Цикл 
		
		ИмяСтраницы = "Страница" + Элемент.Ключ;
		Видимость = ?(Элемент.Значение = Неопределено, Ложь, Элемент.Значение);
		Элементы[ИмяСтраницы].Видимость = Видимость;
		
		Если Видимость Тогда	
			Элементы["Товары" + Элемент.Ключ + "Упаковка"].ОграничениеТипа = ОТУпаковки;	
		КонецЕсли;
		
		Если Видимость И Не ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			ПерваяДоступнаяСтраница = ИмяСтраницы; 
		КонецЕсли;
		
		Если Не Видимость И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы] Тогда
			ТребуетсяСменаСтраницы = Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТребуетсяСменаСтраницы Тогда 
		
		Если ЗначениеЗаполнено(ПерваяДоступнаяСтраница) Тогда
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ПерваяДоступнаяСтраница];		
		Иначе
			
			Для Каждого Страница Из Элементы.ГруппаСтраницы.ПодчиненныеЭлементы Цикл
				
				Если Страница.Видимость Тогда
					Элементы.ГруппаСтраницы.ТекущаяСтраница = Страница;
					Прервать;
				КонецЕсли;
				
			КонецЦикла;

		КонецЕсли;		
			
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #86001

//+ ИнфоСофт Мурсалимов Д.Р. 15.01.24 УА #68819
&НаКлиенте
Процедура УправлениеФормой()

	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница" + Маркетплейс];
	ПоследнийМаркетплейс = Маркетплейс;
	
	Если ЗначениеЗаполнено(Профиль) Тогда
		ЗаполнитьТаблицуСопоставления();
	КонецЕсли;
	
	Если ПодбиратьПо = "Реквизит" Тогда
	
		Если Маркетплейс = "Сбер" Или Маркетплейс = "Али" Тогда
			Элементы.ГруппПодборРеквизит.Видимость = Истина;
		Иначе
			ПодбиратьПо = "ПроизвольныйЗапрос";
		    ОбщегоНазначенияКлиент.СообщитьПользователю("Подбор по ""Реквизиту"" доступен только для Маркетплейсов ""Мега Маркет"" и ""Aliexpress""");
		КонецЕсли;
			
	Иначе
		Элементы.ГруппПодборРеквизит.Видимость = Ложь;
	КонецЕсли;
	
	Если ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		Элементы.УстановитьТекстЗапроса.Видимость = Истина;
	Иначе
		Элементы.УстановитьТекстЗапроса.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 15.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 15.01.24 УА #68819
&НаСервереБезКонтекста   
Функция ПолучитьТекстЗапроса(Маркетплейс)
    
	Текст = "";
	
	//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
	//Добавил упаковки
	//- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
		
	Если Маркетплейс = "Озон" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ИС_Ozon_СоответствиеХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ИС_Ozon_Номенклатура.Ссылка КАК НоменклатураOzon,
		|	ВЫБОР
		|		КОГДА ИС_Ozon_СоответствиеХарактеристик.Упаковка = &ПустаяУпаковка
		|				ИЛИ ИС_Ozon_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL
		|			ТОГДА ИС_Ozon_СоответствиеХарактеристик.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ИС_Ozon_СоответствиеХарактеристик.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Ozon_СоответствиеХарактеристик КАК ИС_Ozon_СоответствиеХарактеристик
		|		ПО ИС_Ozon_Номенклатура.Ссылка = ИС_Ozon_СоответствиеХарактеристик.НоменклатураOzon
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Профиль = &Профиль
		|	И НЕ ИС_Ozon_Номенклатура.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НоменклатураOzon";  
		
		Возврат Текст;	
		
	КонецЕсли;
	
	Если Маркетплейс = "ЯМ" Тогда
		
		Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ИС_ЯМ_СоответствиеХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ИС_ЯМ_Номенклатура.Ссылка КАК НоменклатураЯМ,
		|	ВЫБОР
		|		КОГДА ИС_ЯМ_СоответствиеХарактеристик.Упаковка = &ПустаяУпаковка
		|				ИЛИ ИС_ЯМ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL
		|			ТОГДА ИС_ЯМ_СоответствиеХарактеристик.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ИС_ЯМ_СоответствиеХарактеристик.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
		|		ПО ИС_ЯМ_Номенклатура.Ссылка = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ
		|ГДЕ
		|	ИС_ЯМ_Номенклатура.Профиль = &Профиль
		|	И НЕ ИС_ЯМ_Номенклатура.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НоменклатураЯМ";  
		
		Возврат Текст;	
		
	КонецЕсли;
	
	Если Маркетплейс = "Сбер" Тогда
		
		Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИС_Сбер_Товары.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ИС_Сбер_Товары.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ИС_Сбер_Номенклатура.offer_id КАК offerID,
		|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет,
		|	ВЫБОР
		|		КОГДА ИС_Сбер_Товары.Упаковка = &ПустаяУпаковка
		|				ИЛИ ИС_Сбер_Товары.Упаковка ЕСТЬ NULL
		|			ТОГДА ИС_Сбер_Товары.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ИС_Сбер_Товары.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_Сбер_Товары КАК ИС_Сбер_Товары
		|		ПО (ИС_Сбер_Товары.offerID = ИС_Сбер_Номенклатура.offer_id)
		|			И (ИС_Сбер_Товары.ЛичныйКабинет = ИС_Сбер_Номенклатура.Профиль)
		|ГДЕ
		|	ИС_Сбер_Номенклатура.Профиль = &Профиль
		|	И НЕ ИС_Сбер_Номенклатура.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НоменклатураМегаМаркет";  
		
		Возврат Текст;	
		
	КонецЕсли;
	
	Если Маркетплейс = "Али" Тогда
		
		Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ИС_АЛИ_СоответствиеХарактеристик.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАли,
		|	ИС_АЛИ_Вариации.КодВариации КАК КодСопоставления,
		|	ИС_АЛИ_Вариации.Владелец КАК НоменклатураAli,
		|	ВЫБОР
		|		КОГДА ИС_АЛИ_СоответствиеХарактеристик.Упаковка = &ПустаяУпаковка
		|				ИЛИ ИС_АЛИ_СоответствиеХарактеристик.Упаковка ЕСТЬ NULL
		|			ТОГДА ИС_АЛИ_СоответствиеХарактеристик.Номенклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ИС_АЛИ_СоответствиеХарактеристик.Упаковка
		|	КОНЕЦ КАК Упаковка
		|ИЗ
		|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_АЛИ_СоответствиеХарактеристик КАК ИС_АЛИ_СоответствиеХарактеристик
		|		ПО (ИС_АЛИ_СоответствиеХарактеристик.ВариацияАЛИ = ИС_АЛИ_Вариации.Ссылка)
		|ГДЕ
		|	ИС_АЛИ_Вариации.Профиль = &Профиль
		|	И НЕ ИС_АЛИ_Вариации.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	НоменклатураAli";  
		
		Возврат Текст;	
		
	КонецЕсли;
	
	Текст = ИС_МП_Сервер.ТекстЗапросаСопоставления(Маркетплейс);
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Мурсалимов Д.Р. 15.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаСервере
Процедура ЗаполнитьТаблицуСопоставления()
	
	МП = Перечисления.ИС_МП_Маркетплейсы[Маркетплейс];
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("СопоставлятьПо");
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, МП, МассивПараметров);
	
	Если ЗначениеЗаполнено(Настройки.СопоставлятьПо) Тогда
		ПодбиратьПо = Настройки.СопоставлятьПо;	
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(Маркетплейс);
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Таблица = ЭтотОбъект["Товары" + Маркетплейс];
	
	Таблица.Очистить();
	
	КоличествоСопоставленных = 0;	
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
		НоваяСтрока.ТекущаяНоменклатура = Выборка.Номенклатура;
		НоваяСтрока.ТекущаяХарактеристика = Выборка.Характеристика;
		НоваяСтрока.ТекущаяУпаковка = Выборка.Упаковка;
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			КоличествоСопоставленных = КоличествоСопоставленных + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Делитель = ?(Выборка.Количество() = 0, 1, Выборка.Количество()); 
	ПроцентСопоставленны = Окр(КоличествоСопоставленных / Делитель * 100, 2);	
	ПроцентСопоставления = СтрШаблон("%1 / %2 (%3%%)", 
		КоличествоСопоставленных, Выборка.Количество(), ПроцентСопоставленны);
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура ПрофильПриИзмененииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицуСопоставления();
		Модифицированность = Ложь;
		ОпределитьИнтегрируемыеМаркетплейсы();
	КонецЕсли;   
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 16.01.24 УА #68819
&НаСервере
Процедура ПодборНаСервере(МассивСопоставления, ПолеСопоставления)
	
	Если Маркетплейс = "Озон" Тогда	
		ПодборOzon();
		Возврат;
	ИначеЕсли Маркетплейс = "ЯМ" Тогда	
		ПодборЯМ();
		Возврат;
	ИначеЕсли Маркетплейс = "Сбер" Тогда	
		ПодборМегаМаркет();
		Возврат;
	ИначеЕсли Маркетплейс = "Али" Тогда	
		ПодборAli();
		Возврат;
	ИначеЕсли Маркетплейс = "МВМ" Тогда	
		ПодборМВМ();
		Возврат;
	//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
	ИначеЕсли Маркетплейс = "Ламода" Тогда	
		ПодборЛамода();
		Возврат;
	//- ИнфоСофт Власова И.С. 23.12.24 УА #90120	
	КонецЕсли;

	ПараметрыПодбора = Новый Структура("СопоставлятьПо", ПодбиратьПо);
	
	РезультатПодбора = ИС_МП_Сервер.ПодобратьТовары(Маркетплейс, Профиль, МассивСопоставления, ПараметрыПодбора); 
	
	Если РезультатПодбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПодбора.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого Строка Из РезультатПодбора Цикл
		
		Отбор = Новый Структура(ПолеСопоставления, Строка.ПолеСопоставления);
		
		НайденныеСтроки = ЭтотОбъект["Товары" + Маркетплейс].НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Строка);
			
			НайденныеСтроки[0].Модифицированность = Истина;
			Модифицированность = Истина;

		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 16.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819
&НаСервере
Процедура ПодборOzon()
	
	МассивНоменклатур = Новый Массив;
	
	Для Каждого Строка Из ТоварыОзон Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			МассивНоменклатур.Добавить(Строка.НоменклатураOzon);
		КонецЕсли;	
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_Ozon_Штрихкоды.Наименование КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_Ozon_Штрихкоды КАК ИС_Ozon_Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|		ПО (ИС_Ozon_Штрихкоды.Карточка = ИС_Ozon_Номенклатура.Ссылка)
		|		И ИС_Ozon_Номенклатура.Ссылка В(&НоменклатураOzon) 
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Профиль = &ЛичныйКабинет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	ВТ_Номенклатура.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ВТ_Номенклатура.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод)   
		|		И НЕ ШтрихкодыНоменклатуры.Номенклатура ЕСТЬ NULL"
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Ozon_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_Ozon_Номенклатура.offer_id КАК offer_id
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_Ozon_Номенклатура КАК ИС_Ozon_Номенклатура
		|ГДЕ
		|	ИС_Ozon_Номенклатура.Профиль = &ЛичныйКабинет
		|	И ИС_Ozon_Номенклатура.Ссылка В(&НоменклатураOzon) 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Ссылка КАК Номенклатура,
		//+ ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102		
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
		//- ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_Номенклатура.offer_id = Номенклатура.Артикул
		|		И НЕ Номенклатура.Ссылка ЕСТЬ NULL";    
		
	Иначе
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НоменклатураOzon", МассивНоменклатур);
	Запрос.УстановитьПараметр("ЛичныйКабинет", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НоменклатураOzon");
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.НоменклатураOzon = Выборка.Ссылка;
			НайденныеСтроки = ТоварыОзон.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки[0].Номенклатура = Выборка.Номенклатура;
				
				//+ ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102				
				НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
				Если ПодбиратьПо = "Штрихкод" Тогда
					//НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
					НайденныеСтроки[0].Штрихкод = Выборка.Штрихкод;
					//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
					НайденныеСтроки[0].Упаковка = Выборка.Упаковка; 		
					//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				КонецЕсли;                                  
				//- ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102
			
				НайденныеСтроки[0].Модифицированность = Истина;	
				
				//+ ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
				Модифицированность = Истина;
				//- ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819
&НаСервере
Процедура ПодборЯМ()
	
	МассивНоменклатур = Новый Массив;
	
	Для Каждого Строка Из ТоварыЯМ Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			МассивНоменклатур.Добавить(Строка.НоменклатураЯМ);
		КонецЕсли;	
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_ЯМ_Штрихкоды.Штрихкод КАК Штрихкод
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
		|		ПО (ИС_ЯМ_Штрихкоды.Владелец = ИС_ЯМ_Номенклатура.Ссылка)
		|		И ИС_ЯМ_Номенклатура.Ссылка В(&НоменклатураЯМ) 
		|ГДЕ
		|	ИС_ЯМ_Номенклатура.Профиль = &ЛичныйКабинет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	ВТ_Номенклатура.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ВТ_Номенклатура.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод)
		|		И НЕ ШтрихкодыНоменклатуры.Номенклатура ЕСТЬ NULL";
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
		|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
		|ГДЕ
		|	ИС_ЯМ_Номенклатура.Профиль = &ЛичныйКабинет
		|	И ИС_ЯМ_Номенклатура.Ссылка В(&НоменклатураЯМ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Ссылка КАК Номенклатура,
		//+ ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102		
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика
		//- ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102
		|ИЗ
		|	ВТ_Номенклатура КАК ВТ_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_Номенклатура.shopSku = Номенклатура.Артикул
		|		И НЕ Номенклатура.Ссылка ЕСТЬ NULL";
		
	Иначе
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НоменклатураЯМ", МассивНоменклатур);
	Запрос.УстановитьПараметр("ЛичныйКабинет", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НоменклатураЯМ");
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.НоменклатураЯМ = Выборка.Ссылка;
			НайденныеСтроки = ТоварыЯМ.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки[0].Номенклатура = Выборка.Номенклатура;
				//+ ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102				
				НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
				Если ПодбиратьПо = "Штрихкод" Тогда
					//НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
					НайденныеСтроки[0].Штрихкод = Выборка.Штрихкод;
					//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
					НайденныеСтроки[0].Упаковка = Выборка.Упаковка;
					//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				КонецЕсли;                                  
				//- ИнфоСофт Стояк Ю.К. 20.06.2024 УА #78102
				
				НайденныеСтроки[0].Модифицированность = Истина;	
				
				//+ ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
				Модифицированность = Истина;
				//- ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819
&НаСервере
Процедура ПодборМегаМаркет()
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка,
		//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|	ИС_Сбер_Номенклатура.offer_id КАК offerID,
		|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
		|ИЗ
		|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ИС_Сбер_Номенклатура.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод)
		|ГДЕ
		|	ИС_Сбер_Номенклатура.Профиль = &Профиль     
		|	
		|";
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
		|	Номенклатура.Артикул КАК offerID,
		|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
		|ИЗ
		|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ИС_Сбер_Номенклатура.offer_id = Номенклатура.Артикул
		|ГДЕ
		|	ИС_Сбер_Номенклатура.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли; 
		
	ИначеЕсли ПодбиратьПо = "Реквизит" Тогда   
		
		Если РеквизитПодбора = "" Тогда		
			ОбщегоНазначения.СообщитьПользователю("Не выбран реквизит подбора, продолжение невозможно...");
			Возврат;		
		КонецЕсли;
		
		Если РеквизитПодбора = "Код" Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	Номенклатура.Код КАК offerID,
			|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
			|ИЗ
			|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО (ИС_Сбер_Номенклатура.offer_id = Номенклатура.Код)
			|ГДЕ
			|	ИС_Сбер_Номенклатура.Профиль = &Профиль
			|";
			
		ИначеЕсли РеквизитПодбора = "АртикулПроизводителя" Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
			|	ИС_Сбер_Номенклатура.offer_id КАК offerID,
			|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
			|ИЗ
			|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО (ИС_Сбер_Номенклатура.vendorCode = Номенклатура.Артикул)
			|			И (ИС_Сбер_Номенклатура.Профиль = &Профиль) 
			|			И НЕ Номенклатура.Артикул = """"
			|";
			
		ИначеЕсли РеквизитПодбора = "ДопРеквизит" Тогда
			
			Если ЗначениеЗаполнено(ДопРеквизит) Тогда
				Справочник = ДопРеквизит.НаборСвойств.Родитель.Наименование; 
			Иначе
				Справочник = "";
			КонецЕсли;
			
			Если Справочник = "Характеристики Номенклатуры" Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Номенклатура,
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение КАК offerID,
				|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
				|ИЗ
				|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
				|		ПО (ИС_Сбер_Номенклатура.offer_id = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение)
				|ГДЕ
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство
				|	И НЕ ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение ЕСТЬ NULL
				|	И ИС_Сбер_Номенклатура.Профиль = &Профиль
				|"; 
				
				Запрос.УстановитьПараметр("Свойство", ДопРеквизит); 
				
			ИначеЕсли Справочник = "Номенклатура" Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
				|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
				|	НоменклатураДополнительныеРеквизиты.Значение КАК offerID,
				|	ИС_Сбер_Номенклатура.Ссылка КАК НоменклатураМегаМаркет
				|ИЗ
				|	Справочник.ИС_Сбер_Номенклатура КАК ИС_Сбер_Номенклатура
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				|		ПО (ИС_Сбер_Номенклатура.offer_id = НоменклатураДополнительныеРеквизиты.Значение)
				|ГДЕ
				|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
				|	И НЕ НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
				|	И ИС_Сбер_Номенклатура.Профиль = &Профиль
				|";
				
				Запрос.УстановитьПараметр("Свойство", ДопРеквизит);
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не удалось найти сопоставление");
		Возврат;
	КонецЕсли;  
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("НоменклатураМегаМаркет");
	
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.НоменклатураМегаМаркет = Выборка.НоменклатураМегаМаркет;
			НайденныеСтроки = ТоварыСбер.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки[0].Номенклатура = Выборка.Номенклатура;
				НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
				НайденныеСтроки[0].OfferID = Выборка.offerID;
				НайденныеСтроки[0].НоменклатураМегаМаркет = Выборка.НоменклатураМегаМаркет;
				//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				Если ПодбиратьПо = "Штрихкод" Тогда
					НайденныеСтроки[0].Упаковка = Выборка.Упаковка; 		
				КонецЕсли;
				//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				НайденныеСтроки[0].Модифицированность = Истина;
				
				//+ ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
				Модифицированность = Истина;
				//- ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
		
			Иначе
		
				НоваяСтрока = ТоварыСбер.Добавить();
				НоваяСтрока.Номенклатура = Выборка.Номенклатура;
				НоваяСтрока.Характеристика = Выборка.Характеристика;
				НоваяСтрока.OfferID = Выборка.offerID; 
				НоваяСтрока.НоменклатураМегаМаркет = Выборка.НоменклатураМегаМаркет;
				//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				Если ПодбиратьПо = "Штрихкод" Тогда
					НоваяСтрока.Упаковка = Выборка.Упаковка; 		
				КонецЕсли;
				//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819

//+ ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819
&НаСервере
Процедура ПодборAli()
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАли,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
		|ИЗ
		|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ИС_АЛИ_Вариации.КодВариации = ШтрихкодыНоменклатуры.Штрихкод
		|ГДЕ
		|	ИС_АЛИ_Вариации.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАли,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ИС_АЛИ_Вариации.КодВариации = Номенклатура.Артикул
		|ГДЕ
		|	ИС_АЛИ_Вариации.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли; 
		
	ИначеЕсли ПодбиратьПо = "Реквизит" Тогда
		
		Если РеквизитПодбора = "" Тогда		
			ОбщегоНазначения.СообщитьПользователю("Не выбран реквизит подбора, продолжение невозможно...");
			Возврат;		
		КонецЕсли;
		
		Если РеквизитПодбора = "ДопРеквизит" Тогда
			
			Если ЗначениеЗаполнено(ДопРеквизит) Тогда
				Справочник = ДопРеквизит.НаборСвойств.Родитель.Наименование; 
			Иначе
				Справочник = "";
			КонецЕсли;
			
			Если Справочник = "Характеристики Номенклатуры" Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка.Владелец КАК Номенклатура,
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Ссылка КАК Характеристика,
				|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАли
				|ИЗ
				|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры.ДополнительныеРеквизиты КАК ХарактеристикиНоменклатурыДополнительныеРеквизиты
				|		ПО (ИС_АЛИ_Вариации.КодВариации = ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение)
				|ГДЕ
				|	ХарактеристикиНоменклатурыДополнительныеРеквизиты.Свойство = &Свойство
				|	И НЕ ХарактеристикиНоменклатурыДополнительныеРеквизиты.Значение ЕСТЬ NULL
				|	И ИС_АЛИ_Вариации.Профиль = &Профиль
				|"; 
				
				Запрос.УстановитьПараметр("Свойство", ДопРеквизит); 
				
			ИначеЕсли Справочник = "Номенклатура" Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
				|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка) КАК Характеристика,
				|	ИС_АЛИ_Вариации.Ссылка КАК ВариацияАли
				|ИЗ
				|	Справочник.ИС_АЛИ_Вариации КАК ИС_АЛИ_Вариации
				|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
				|		ПО (ИС_АЛИ_Вариации.КодВариации = НоменклатураДополнительныеРеквизиты.Значение)
				|ГДЕ
				|	НоменклатураДополнительныеРеквизиты.Свойство = &Свойство
				|	И НЕ НоменклатураДополнительныеРеквизиты.Значение ЕСТЬ NULL
				|	И ИС_АЛИ_Вариации.Профиль = &Профиль
				|";
				
				Запрос.УстановитьПараметр("Свойство", ДопРеквизит); 
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Профиль", Профиль);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ВариацияАли");
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.ВариацияАли = Выборка.ВариацияАли;
			НайденныеСтроки = ТоварыАли.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				НайденныеСтроки[0].Номенклатура = Выборка.Номенклатура;					
				
				Если ПодбиратьПо = "Штрихкод" Тогда
					НайденныеСтроки[0].Характеристика = Выборка.Характеристика;
					//+ ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
					НайденныеСтроки[0].Упаковка = Выборка.Упаковка; 		
					//- ИнфоСофт Конышев А.Е. 12.12.24 УА #84415
				КонецЕсли;
			
				НайденныеСтроки[0].Модифицированность = Истина;
				
				//+ ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
				Модифицированность = Истина;
				//- ИнфоСофт Мурсалимов Д.Р. 01.02.24 УА #69831
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
&НаСервере
Процедура ПодборМВМ()
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_МВМ_Товары.Ссылка КАК ТоварМВМ,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
		|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
		|ИЗ
		|	Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ИС_МВМ_Товары.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
		|ГДЕ
		|	ИС_МВМ_Товары.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_МВМ_Товары.Ссылка КАК ТоварМВМ,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ЕдиницаИзмерения КАК Упаковка
		|ИЗ
		|	Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ИС_МВМ_Товары.Артикул = Номенклатура.Артикул
		|ГДЕ
		|	ИС_МВМ_Товары.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Выбран неподдерживаемый способ сопоставления для МП МВидео");
		Возврат;		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Профиль", Профиль);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТоварМВМ");
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.ТоварМВМ = Выборка.ТоварМВМ;
			НайденныеСтроки = ТоварыМВМ.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Выборка); 
			
				НайденныеСтроки[0].Модифицированность = Истина;	
				Модифицированность = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
&НаСервере
Процедура ПодборЛамода()
	
	Запрос = Новый Запрос;
	
	Если ПодбиратьПо = "Штрихкод" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
			|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
			|	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика,
			|	ШтрихкодыНоменклатуры.Упаковка КАК Упаковка
			|ИЗ
			|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
			|		ПО ИС_Ламода_РазмерыНоменклатуры.barcode = ШтрихкодыНоменклатуры.Штрихкод
			|ГДЕ
			|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "Артикул" Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИС_Ламода_РазмерыНоменклатуры.Ссылка КАК РазмерЛамода,
			|	Номенклатура.Ссылка КАК Номенклатура,
			|	Номенклатура.ЕдиницаИзмерения КАК Упаковка
			|ИЗ
			|	Справочник.ИС_Ламода_РазмерыНоменклатуры КАК ИС_Ламода_РазмерыНоменклатуры
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО ИС_Ламода_РазмерыНоменклатуры.seller_sku = Номенклатура.Артикул
			|ГДЕ
			|	ИС_Ламода_РазмерыНоменклатуры.Профиль = &Профиль";
		
	ИначеЕсли ПодбиратьПо = "ПроизвольныйЗапрос" Тогда
		
		МассивПараметров = Новый Массив();
		МассивПараметров.Добавить("ТекстЗапросаСопоставления");
	
		Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, 
			Перечисления.ИС_МП_Маркетплейсы[Маркетплейс], МассивПараметров, "Строка");
				
		Если ЗначениеЗаполнено(Настройки.ТекстЗапросаСопоставления) Тогда
			Запрос.Текст = Настройки.ТекстЗапросаСопоставления;
		Иначе
			ОбщегоНазначения.СообщитьПользователю("Не заполнен текст запроса для сопоставления, продолжение невозможно...");
			Возврат;
		КонецЕсли;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Выбран неподдерживаемый способ сопоставления для МП Lamoda");
		Возврат;		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Профиль", Профиль);

	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("РазмерЛамода");
	
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			
			СтруктураПоиска.РазмерЛамода = Выборка.РазмерЛамода;
			НайденныеСтроки = ТоварыЛамода.НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				Если ЗначениеЗаполнено(НайденныеСтроки[0].ТекущаяНоменклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				ЗаполнитьЗначенияСвойств(НайденныеСтроки[0], Выборка); 
			
				НайденныеСтроки[0].Модифицированность = Истина;	
				Модифицированность = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Власова И.С. 23.12.24 УА #90120

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаСервере   
Процедура ЗаписатьИзмененияНаСервере()
		
	Для Каждого Элемент Из ЭтотОбъект["Товары" + Маркетплейс] Цикл
		
		Если Элемент.Модифицированность И ЗначениеЗаполнено(Элемент.Номенклатура) Тогда 
			
			//+ ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
			Если Не ЗначениеЗаполнено(Элемент.Упаковка) Тогда			
				Элемент.Упаковка = Элемент.Номенклатура.ЕдиницаИзмерения;		
			КонецЕсли;
			
			Если Маркетплейс = "ВБ" Тогда
			
				ИС_WB_Сервер.ДобавитьСоответствиеРазмеров(Профиль, Элемент.РазмерWB, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика); 
				
			ИначеЕсли Маркетплейс = "Озон" Тогда
				
				ИС_Ozon_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, Элемент.НоменклатураOzon, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);  
				
			ИначеЕсли Маркетплейс = "ЯМ" Тогда	
				
				ИС_ЯМ_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, Элемент.НоменклатураЯМ, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);	
				
			ИначеЕсли Маркетплейс = "Сбер" Тогда 
				
				ИС_Сбер_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, Элемент.OfferID, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);
				
			ИначеЕсли Маркетплейс = "Али" Тогда	
				
				ИС_АЛИ_Сервер.ДобавитьСоответствиеНоменклатуры(Профиль, Элемент.ВариацияАЛИ, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);
					
			ИначеЕсли Маркетплейс = "МВМ" Тогда	
				
				ИС_МВМ_Сервер.ДобавитьСоответствиеТовара(Профиль, Элемент.ТоварМВМ, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);
					
			//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
			ИначеЕсли Маркетплейс = "Ламода" Тогда	
				
				ИС_Ламода_Сервер.ДобавитьСоответствиеТовара(Профиль, Элемент.РазмерЛамода, Элемент.Номенклатура, 
					Элемент.Характеристика, Элемент.Упаковка, Элемент.ТекущаяНоменклатура, Элемент.ТекущаяХарактеристика);
			//- ИнфоСофт Власова И.С. 23.12.24 УА #90120		
					
			КонецЕсли;
			//- ИнфоСофт Мурсалимов Д.Р. 17.01.24 УА #62628
			
		КонецЕсли; 
		
	КонецЦикла;		

	Модифицированность = Ложь;

	ЗаполнитьТаблицуСопоставления();

КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаСервере
Процедура УдалитьСопоставлениеНаСервере()
	
	ВыделенныеСтроки = Элементы["Товары" + Маркетплейс].ВыделенныеСтроки;
	
	Для Каждого Идентификатор Из ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = ЭтотОбъект["Товары" + Маркетплейс].НайтиПоИдентификатору(Идентификатор);
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.ТекущаяНоменклатура) Тогда
			Продолжить;                                                          
		КонецЕсли;
		
		Если Маркетплейс = "ВБ" Тогда
			
			НаборЗаписей = РегистрыСведений.ИС_WB_СоответствиеРазмеров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Профиль.Установить(Профиль);
			НаборЗаписей.Отбор.РазмерWB.Установить(СтрокаТаблицы.РазмерWB);
			НаборЗаписей.Отбор.Номенклатура.Установить(СтрокаТаблицы.ТекущаяНоменклатура);
			НаборЗаписей.Отбор.Характеристика.Установить(СтрокаТаблицы.ТекущаяХарактеристика);
			
		ИначеЕсли Маркетплейс = "Озон" Тогда 
			
			НаборЗаписей = РегистрыСведений.ИС_Ozon_СоответствиеХарактеристик.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НоменклатураOzon.Установить(СтрокаТаблицы.НоменклатураOzon); 
			
		ИначеЕсли Маркетплейс = "ЯМ" Тогда   
			
			НаборЗаписей = РегистрыСведений.ИС_ЯМ_СоответствиеХарактеристик.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.НоменклатураЯМ.Установить(СтрокаТаблицы.НоменклатураЯМ);
			
		ИначеЕсли Маркетплейс = "Сбер" Тогда 
			
			НаборЗаписей = РегистрыСведений.ИС_Сбер_Товары.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.offerID.Установить(СтрокаТаблицы.offerID);
			
		ИначеЕсли Маркетплейс = "Али" Тогда  
			
			НаборЗаписей = РегистрыСведений.ИС_АЛИ_СоответствиеХарактеристик.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ВариацияАли.Установить(СтрокаТаблицы.ВариацияАли);
			
		ИначеЕсли Маркетплейс = "МВМ" Тогда  
			
			НаборЗаписей = РегистрыСведений.ИС_МВМ_СоответствиеТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ТоварМВМ.Установить(СтрокаТаблицы.ТоварМВМ);
			
		//+ ИнфоСофт Власова И.С. 23.12.24 УА #90120
		ИначеЕсли Маркетплейс = "Ламода" Тогда  
			
			НаборЗаписей = РегистрыСведений.ИС_Ламода_СоответствиеТоваров.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.РазмерЛамода.Установить(СтрокаТаблицы.РазмерЛамода);
		//- ИнфоСофт Власова И.С. 23.12.24 УА #90120	
			
		КонецЕсли;
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		
		НаборЗаписей.Записывать = Истина;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	ЗаполнитьТаблицуСопоставления();
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006
&НаКлиенте
Процедура ПриЗакрытиииЗавершение(Результат, Параметры) Экспорт
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;   
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 08.12.23 УА #67006

//+ ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819
&НаКлиенте
Процедура ПриСменеСтраницыЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено Тогда
    	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница" + ПоследнийМаркетплейс];
    	Возврат;
    КонецЕсли;
	
	Если Результат.Значение = КодВозвратаДиалога.Да Тогда 
	    	    
	    Для Каждого Строка Из ЭтотОбъект["Товары" + ПоследнийМаркетплейс] Цикл 
	    	Строка.Модифицированность = Ложь;
	    КонецЦикла;
	    
		Модифицированность = Ложь;
		ЗаполнитьТаблицуСопоставления();
		ПоследнийМаркетплейс = Маркетплейс;
	
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы["Страница" + ПоследнийМаркетплейс];
	КонецЕсли;   
	
КонецПроцедуры //- ИнфоСофт Мурсалимов Д.Р. 24.01.24 УА #68819

//+ ИнфоСофт Ивонин К.А. 26.03.24 УА #71892
&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДопПараметры) Экспорт
    
    Если Результат = Неопределено Тогда
    	Возврат;
    КонецЕсли;
    
    Если Результат.Значение = КодВозвратаДиалога.Да Тогда	
    	Модифицированность = Ложь;
    	Закрыть();	  	
    КонецЕсли;
    	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 26.03.24 УА #71892

#КонецОбласти
